
import random

# 定义姓氏列表
surnames = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩',
            '杨', '朱', '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏',
            '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚',
            '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳',
            '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗',
            '毕', '郝', '邬', '安', '常', '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余',
            '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵', '汪', '祁', '毛',
            '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊',
            '纪', '舒', '屈', '项', '祝', '董', '梁']
# 定义名字列表
names = ['伟', '芳', '勇', '秀', '敏', '静',
         '丽', '强', '磊', '军', '洋', '霞', '娟', '涛', '明', '超', '秀', '艳', '杰', '娜', '鹏',
         '萍', '东', '峰', '华', '国', '玲', '建', '文', '健', '红', '阳', '俊', '颖', '亮', '晶',
         '成', '平', '文', '旭', '海', '雷', '欣', '丹', '龙', '锋', '刚', '帅', '瑞', '雯', '慧',
         '涵', '菡', '梓', '馨', '怡', '子', '涓', '悦', '雪', '思', '瑶', '晨', '文', '菁', '竹',
         '若', '轩', '秋', '宇', '灵', '茜', '琳', '倩', '琪', '蕊', '嫣', '婷', '娜', '玉', '静',
         '欣', '慧', '颖', '嘉', '欢', '娟', '妍', '梦', '凌', '楠', '佳', '晴', '诗', '钰', '雅',
         '舒', '彤', '露', '娥', '妮', '洁', '媛', '婕', '怀', '莹', '珊', '芷', '姿', '菲', '蓉',
         '芝', '娅', '曼', '妤', '蓓', '春', '月', '薇', '睿', '妙', '琦', '桂', '娣', '泓', '玲',
         '娉', '雯', '蔚', '懿', '琼', '仪', '明', '华', '强', '超', '文', '云', '静', '宇', '欣',
         '洋', '璐', '婷', '杰', '军', '梦', '倩', '丽', '晶', '晨', '浩', '琳', '涛', '宁', '娟',
         '艳', '峰', '鑫', '佳', '雪', '丹', '琴', '磊', '莉', '春', '秀', '英', '鹏', '凯', '红',
         '勇', '宏', '博', '娜', '俊', '敏', '龙', '芳', '帅', '威', '兵', '玲', '建', '平', '彬',
         '燕', '伟', '淼', '欢', '辉', '波', '旭', '蓉', '海', '丰', '翔', '胜', '霞', '斌', '瑞',
         '晓', '雯', '健', '新', '琪', '宝', '桂', '小', '卫', '利', '恒', '凡', '琦', '秋', '泽',
         '东', '立', '鸣', '婕', '玉', '亚', '琼', '菲', '旺', '荣', '民', '喜']

def random_name():
    # 从姓氏列表中随机选择一个姓氏
    surname = random.choice(surnames)
    # 从名字列表中随机选择一个名字
    name = random.choice(names)
    # 将姓氏和名字拼接起来形成一个完整的中文名
    full_name = surname + name
    if random.random() < 0.7:
        full_name = full_name + random.choice(names)
    return full_name

def random_id():
    # 随机生成前17位数字
    id_no_prefix = str(random.randint(110000, 659004))
    id_no_prefix += str(random.randint(1900, 2022)).zfill(4)
    id_no_prefix += str(random.randint(1, 12)).zfill(2)
    id_no_prefix += str(random.randint(1, 28)).zfill(2)
    id_no_prefix += str(random.randint(100, 999)).zfill(3)

    # 计算校验码
    weight = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2]
    check_code_dict = {0: "1", 1: "0", 2: "X", 3: "9", 4: "8",
                       5: "7", 6: "6", 7: "5", 8: "4", 9: "3", 10: "2"}
    check_sum = sum([int(id_no_prefix[i]) * weight[i] for i in range(17)])
    check_code = check_code_dict.get(check_sum % 11)

    # 拼接得到完整的身份证号
    id_no = id_no_prefix + check_code
    return id_no
p_head = ['134','135','136','137','138','139','147','150','151','152','157','158','159',
          '130','131','132','155','156','176','185','186','133','149','153','173','177',
          '180','181','189']
# 打开文件，以追加模式写入
with open(r'X:\大二下\数据库系统\实践\期末项目\数据\user.txt', 'a', encoding='utf-8') as f:
    # 生成10个随机中文名，并写入文件
    for i in range(100000):
        id = random_id()
        name = random_name()
        if int(id[16]) & 1:
            sex = '男'
        else:
            sex = '女'
        age = random.randint(18,80)
        p_num = random.choice(p_head)
        for j in range(8):
            p_num =p_num + str(random.randint(0,9))
        print(i+100001,id,name,sex,age,p_num,'12345','0', file=f)
        #print(i+1,id,name,sex,age,p_num,'12345','0')

